-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2026-01-06 02:53:33
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `stcalendar`
--

-- --------------------------------------------------------

--
-- 資料表結構 `calendar_events`
--

CREATE TABLE `calendar_events` (
  `event_id` int(11) NOT NULL COMMENT '編號',
  `event_publisher` varchar(50) NOT NULL COMMENT '發佈人姓名',
  `created_time` datetime DEFAULT current_timestamp() COMMENT '發佈時間',
  `update_time` datetime NOT NULL DEFAULT current_timestamp() COMMENT '更新時間',
  `event_title` varchar(255) NOT NULL COMMENT '活動名稱',
  `event_start_date` datetime NOT NULL DEFAULT current_timestamp() COMMENT '活動日期，例如 2025-12-03',
  `event_end_date` datetime NOT NULL DEFAULT current_timestamp() COMMENT '結束時間/活動結束',
  `event_date` date DEFAULT NULL COMMENT '動態整理活動日',
  `event_location` varchar(50) NOT NULL COMMENT '活動位置',
  `event_category` varchar(50) NOT NULL COMMENT '活動類別',
  `event_organizer` varchar(50) NOT NULL COMMENT '承辦單位',
  `event_implementer` varchar(50) NOT NULL COMMENT '承辦人',
  `event_lector` varchar(50) NOT NULL COMMENT '講師',
  `event_note` varchar(200) NOT NULL COMMENT '備註'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `calendar_events`
--

INSERT INTO `calendar_events` (`event_id`, `event_publisher`, `created_time`, `update_time`, `event_title`, `event_start_date`, `event_end_date`, `event_date`, `event_location`, `event_category`, `event_organizer`, `event_implementer`, `event_lector`, `event_note`) VALUES
(1, 'Peter', '2025-12-29 09:36:53', '2025-12-31 14:06:49', '測試001，活動為今天日期', '2025-12-29 09:16:00', '2025-12-29 10:12:31', '2025-12-29', 'P0B10201 樂活教室', '教育', '芳心好美館', '楊國忠  ', 'Peter', '使用討論室'),
(2, 'Carol', '2025-12-25 09:36:53', '2025-12-31 16:28:35', '電工實習', '2025-12-29 08:00:00', '2025-12-29 16:12:59', '2025-12-29', 'P0A30104 接待室', '教育', '電工', '承辦人6', 'Carol', '備廚餘桶，地板加強清潔'),
(3, 't1', '2025-12-29 14:50:29', '2025-12-29 14:50:29', '香草園協作坊-社區健康組', '2025-12-18 09:00:00', '2025-12-18 14:53:00', '2025-12-18', 'P0A30102 簡報室', '一般', '東區職訓', '王頌恩', '', '請備垃圾桶及廚餘桶'),
(4, 't2', '2025-12-29 15:31:16', '2025-12-29 15:31:16', '種植活動', '2025-12-10 09:00:00', '2025-12-10 15:30:00', '2025-12-10', 'P0D20201 多功能大教室', '一般', '', '承辦人6', '', '70人，需備廚餘桶'),
(5, 't34', '2025-12-29 16:00:00', '2025-12-31 14:05:23', '看電影', '2025-12-03 09:30:00', '2025-12-03 15:59:00', '2025-12-03', 'P0G20201 雨田大樓二樓烘培教室', '一般', '加工', '承辦人1', 'pETER', '白冷精神長廊'),
(6, 'T2', '2025-12-29 16:45:25', '2025-12-29 16:45:25', '慢跑', '2025-12-26 09:00:00', '2025-12-26 16:45:00', '2025-12-26', 'place5', '一般', '', '承辦人2', '', '123'),
(9, 'Peter', '2025-12-30 13:36:28', '2025-12-30 13:36:28', '衛生局醫政科場租', '2025-12-29 09:00:00', '2025-12-30 13:36:00', '2025-12-29', 'H0A10301 三樓大禮堂', '一般', '2', '承辦人3', '', '(主席/紀錄:綜長機構)'),
(10, 'JC', '2025-12-30 13:37:16', '2025-12-30 13:37:16', '衛生局醫政科場租2', '2025-12-29 09:00:00', '2025-12-29 13:37:00', '2025-12-29', 'H0A10404 四樓會議室', '一般', '2', '承辦人4', '', '約40人，備廚餘桶'),
(12, 'Peter', '2025-12-30 15:20:02', '2025-12-30 15:20:02', '測試001，活動為今天日期', '2025-12-29 00:00:00', '2025-12-29 10:12:31', '2025-12-29', 'H0A10301 三樓大禮堂', '一般', '外單位', '承辦人6', 'Peter', '請備廚餘桶+回收桶+垃圾桶'),
(13, 't34', '2025-12-30 15:20:19', '2025-12-31 14:05:58', '閱讀時間', '2025-12-03 11:30:00', '2025-12-03 15:59:00', '2025-12-03', 'P0D20201 多功能大教室', '一般', '加工', '承辦人', 'pETER', '1.職安不法侵害處理 2.資訊系統現況 3.BMRI退場 4.督考相關檢討 5.編製異動 6.找新醫生前置作業'),
(14, 't34', '2025-12-30 15:33:55', '2025-12-31 14:06:32', '植樹節', '2025-12-03 05:21:00', '2025-12-03 15:59:00', '2025-12-03', 'P0A20101 聖堂', '一般', '加工', '承辦人13', 'pETER', '主席/紀錄:樂智機構'),
(16, 'T1', '2025-12-30 15:45:55', '2026-01-02 13:40:44', '彩繪', '2025-12-30 09:00:00', '2026-01-02 17:40:00', '2025-12-30', 'T7', '一般', 'T1', '承辦人1', '666', '66'),
(17, 'T6', '2025-12-30 16:39:25', '2026-01-02 14:30:40', '研習營', '2025-12-02 09:00:00', '2025-12-02 09:00:00', '2025-12-02', '多媒體教室', '一般', '', '承辦人3', 'T6', 'T6'),
(19, 'BUBU', '2025-12-31 15:13:56', '2025-12-31 15:13:56', '跨年', '2025-12-31 10:00:00', '2025-12-31 07:00:00', '2025-12-31', '醫院', '一般', '綜長機構', 'Peter', 'peter', '請備廚餘桶+垃圾桶+回收桶'),
(20, 'Petert', '2025-12-31 17:08:13', '2025-12-31 17:08:13', '活動1', '2025-12-09 08:00:00', '2025-12-09 17:00:00', '2025-12-09', '會議室A', '一般', '電工', 'Petert', 'Petert', '123'),
(21, 'Peter', '2026-01-02 14:02:30', '2026-01-05 10:10:32', '2026.01.021活動主題', '2026-01-02 08:00:00', '2026-01-02 17:00:00', '2026-01-02', '園區', '一般', '承辦單位Link', '承辦人Peter', '講師Peter', '123'),
(22, 'QQ', '2026-01-02 14:28:18', '2026-01-02 14:28:18', '2026新活動', '2026-01-02 08:00:00', '2026-01-02 17:00:00', '2026-01-02', '醫院', '一般', 'PETER', 'PETER', 'PETER', '123'),
(23, 'Peter', '2026-01-02 17:27:22', '2026-01-05 10:10:49', 'Peter', '2026-01-03 08:00:00', '2026-01-03 17:00:00', '2026-01-03', '園區', '一般', '', '承辦人cc', 'Peter', 'Peter'),
(24, 'Peter', '2026-01-02 17:27:42', '2026-01-02 17:27:42', 'TEST1醫院', '2026-01-13 08:00:00', '2026-01-13 17:00:00', '2026-01-13', '醫院', '一般', '', 'Peter', 'Peter', 'Peter'),
(25, 'Peter', '2026-01-02 17:28:00', '2026-01-02 17:28:00', 'TEST園區', '2026-01-23 08:00:00', '2026-01-23 17:00:00', '2026-01-23', '園區', '一般', '', 'Peter', 'Peter', 'Peter'),
(26, 'Peter', '2026-01-05 16:25:32', '2026-01-06 09:36:14', '演講', '2026-01-05 08:00:00', '2026-01-05 17:00:00', '2026-01-05', '醫院', '一般', '台東', 'CC2', 'CC1', '活動地點為健康活力站以及樂智廣場3'),
(27, 'T1', '2026-01-05 17:11:40', '2026-01-05 17:11:40', '增加週模式', '2026-01-05 08:00:00', '2026-01-05 17:00:00', '2026-01-05', '醫院', '一般', 'T6', 'Peter', 'Peter', '123');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `calendar_events`
--
ALTER TABLE `calendar_events`
  ADD PRIMARY KEY (`event_id`),
  ADD KEY `idx_date` (`event_start_date`),
  ADD KEY `idx_event_date` (`event_date`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `calendar_events`
--
ALTER TABLE `calendar_events`
  MODIFY `event_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '編號', AUTO_INCREMENT=29;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
